import './Services.css';
import React from 'react';

// const services = [
//     {
//         header: 'Проектирование монолитных железобетонных зданий жилого и общественного назначения',
//         description: 'Выполняем проектирование раздела КЖ c использованием технологий BIM-моделирования. Для расчётов используем такие программы как SCAD, Лира-Сапр. Подтверждаем свои расчёты локальными ручными проверками.Чертежи содержат полную информацию для необходимого выполнения на строительной площадке: спецификации, планы, детальные узлы конструкций'
//     },
//     {
//         header: 'Проектирование металлических конструкций различного назначения',
//         description: 'Выполняем проектирование раздела КМ таких типов объектов как: промышленные здания, общественные здания, навесы и арт-объекты, эстакады, технологические площадки и подконструкции.Чертежи содержат необходимую информацию для формирования бюджета проекта, планирования строительного процесса и передачи на завод-изготовитель металлоконструкций'
//     },
//     {
//         header: 'Проектирование монолитных железобетонных зданий жилого и общественного назначения',
//         description: 'Выполняем проектирование раздела КЖ c использованием технологий BIM-моделирования. Для расчётов используем такие программы как SCAD, Лира-Сапр. Подтверждаем свои расчёты локальными ручными проверками.Чертежи содержат полную информацию для необходимого выполнения на строительной площадке: спецификации, планы, детальные узлы конструкций'
//     },
//     {
//         header: 'Проектирование монолитных железобетонных зданий жилого и общественного назначения',
//         description: 'Выполняем проектирование раздела КЖ c использованием технологий BIM-моделирования. Для расчётов используем такие программы как SCAD, Лира-Сапр. Подтверждаем свои расчёты локальными ручными проверками.Чертежи содержат полную информацию для необходимого выполнения на строительной площадке: спецификации, планы, детальные узлы конструкций'
//     },
//     {
//         header: 'Проектирование монолитных железобетонных зданий жилого и общественного назначения',
//         description: 'Выполняем проектирование раздела КЖ c использованием технологий BIM-моделирования. Для расчётов используем такие программы как SCAD, Лира-Сапр. Подтверждаем свои расчёты локальными ручными проверками.Чертежи содержат полную информацию для необходимого выполнения на строительной площадке: спецификации, планы, детальные узлы конструкций'
//     },
//     {
//         header: 'Проектирование монолитных железобетонных зданий жилого и общественного назначения',
//         description: 'Выполняем проектирование раздела КЖ c использованием технологий BIM-моделирования. Для расчётов используем такие программы как SCAD, Лира-Сапр. Подтверждаем свои расчёты локальными ручными проверками.Чертежи содержат полную информацию для необходимого выполнения на строительной площадке: спецификации, планы, детальные узлы конструкций'
//     },

// ]

const services = [
    {
        name: "консультации",
        description: "Консультируем по всем вопросикам что куда балку воткнуть все знаем ребята"
    },
    {
        name: "проектирование",
        description: "Могем запроектировать что вам по кайфу но дорого будет"
    },
    {
        name: "управление проектами",
        description: "Управляем с кайфом ежжи"
    },
    {
        name: "технический аудит",
        description: "Техническо аудированные ребята"
    },
]

const Services = () => {
    return (
        <div className='services'>
            <div className='container'>
            <span className='services__header'>УСЛУГИ</span>

                <div className='services__box'>
                    {services.map((e, index) => {
                        return (
                            <div className='services__item'>
                                <span>0{index + 1}</span>
                                <p className='services__item-name'>{e.name}</p>
                                <p className='services__item-description'>{e.description}</p>
                                <button  className='services__item-btn'></button>
                            </div>
                        )
                    })}
                </div>
            </div>
        </div>
    );
}

export default Services;



/* <div className='sevices'>
<div className='container'>
    <span className='sevices__header'>УСЛУГИ</span>

    {services.map((e, index) =>
        <div className='sevices__item'>
            <h3 className='sevices__item-header'>{e.header}</h3>
            <hr />
            <p className='sevices__description'>{e.description}</p>
        </div>)}
</div>
</div> */