import './ServicesItem.css';

const services = [
    [
        {
            header: 'Проектирование монолитных железобетонных зданий жилого и общественного назначения',
            description: 'Выполняем проектирование раздела КЖ c использованием технологий BIM-моделирования. Для расчётов используем такие программы как SCAD, Лира-Сапр. Подтверждаем свои расчёты локальными ручными проверками.Чертежи содержат полную информацию для необходимого выполнения на строительной площадке: спецификации, планы, детальные узлы конструкций'
        },
        {
            header: 'Проектирование металлических конструкций различного назначения',
            description: 'Выполняем проектирование раздела КМ таких типов объектов как: промышленные здания, общественные здания, навесы и арт-объекты, эстакады, технологические площадки и подконструкции.Чертежи содержат необходимую информацию для формирования бюджета проекта, планирования строительного процесса и передачи на завод-изготовитель металлоконструкций'
        },
        {
            header: 'Проектирование проектов капитального ремонта, реконструкции и усиления',
            description: 'Выполняем проектирование раздела КР для существующих строений с целью как косметического-капитального ремонта, так и усиления существующих конструкций. Чертежи содержат полную информацию о применяемых материалах, технологии и последовательности проведения работ. Используем индивидуальный подход к каждому сооружению'
        },
        {
            header: 'Расчёты строительных конструкций',
            description: 'Выполняем расчёты строительных конструкций с использованием пространственных схем и расчётных комплексов. Анализируем результаты, оптимизируем конструкции для достижения максимального экономического эффекта и требуемой несущей способности. Формируем расчётно-пояснительную записку с исчерпывающей информацией для выполнения чертежей'
        },
        {
            header: 'Проектирование индивидуальных жилых зданий премиум класса',
            description: 'Выполняем проектирование малоэтажных строений со сложными и интересными решениями по разделам АР и КР. Воплотим в жизнь сложную, и, даже, невероятную геометрию из различных материалов: железобетон, каменные материалы, металл, дерево или их различные комбинации. Проект содержит все необходимые чертежи и расчёты для строительства'
        },
        {
            header: 'Геотехническое проектирование',
            description: 'Выполняем проекты глубоких котлованов и использование шпунтовых ограждений или ограждений типа «стена в грунте».Проект включает в себя как расчётное-обоснование так и полный пакет чертежей необходим для выполнения работ.'
        }],

]
const ServicesItem = () => {
    return (
        <div className='sevice'>
            <div className='container'>
                <span className='sevice__item-header'>ПРОЕКТИРОВАНИЕ</span>

                {services[0].map((e, index) =>
                    <div className='sevice__item'>
                        <input className='sevice__item-input' id={`${index}`} type="checkbox" name="" />

                        <label for={`${index}`} className='sevices__item-title'>

                            {e.header}
                        </label>
                        <hr />

                        <p className='sevices__item-description'>{e.description}</p>


                    </div>)}

                    <a href='https://forms.yandex.ru/cloud/64d4ded369387211d3f58ffa/' className="btn" target='blank'>
                        ОСТАВИТЬ ЗАЯВКУ
                    </a>
            </div>
        </div>
    );
}

export default ServicesItem;