export const projectData = [
    {
        id: 1,
        name: 'Рыбоводный завод лососевых рыб',
        title: 'Наши специалисты принимали участие в проектирование конструктивных решений рыбоводного завод для производства посадочного материала лососевых видов рыб. Завод представляет собой промышленное здание. Несущие конструкции представлены из комбинации сборного/монолитного железобетона и металлического каркаса. Проект выполнен с использованием BIM - технологий в программе Revit.',
        img: 'project_1.jpg',
        photos: [1,2,3,4,5,6]
    },
    {
        id: 4,
        name: 'Нежилое здание г.Москва',
        title: 'анализ технического состояния конструкций',
        img: 'project_1.jpg'
    },
    {
        id: 5,
        name: 'Древня хуйня',
        title: 'Райан Гослинг',
        img: 'contacts_0.jpg'
    },
    {
        id: 6,
        name: 'Машина Убийца',
        title: 'Райан Гослинг',
        img: 'contacts_0.jpg'
    },

]